-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\files.s-3.com\HPDA\AHRQ\Fang\bj001\exercise3.log
  log type:  text
 opened on:  22 Feb 2017, 14:29:02

. cd \\files.s-3.com\HPDA\AHRQ\Fang\bj001
\\files.s-3.com\HPDA\AHRQ\Fang\bj001

. 
. use dupersid duid cpsfamid famwt14c varstr varpsu totslf14 ttlp14x using h171

. 
. sort duid cpsfamid

. list duid cpsfamid totslf14 ttlp14x in 1/20

     +---------------------------------------+
     |  duid   cpsfamid   totslf14   ttlp14x |
     |---------------------------------------|
  1. | 40001          A        152     56000 |
  2. | 40001          A         89         0 |
  3. | 40001          A        135         0 |
  4. | 40001          A        165     12000 |
  5. | 40002          A          2     27030 |
     |---------------------------------------|
  6. | 40004          A         12         0 |
  7. | 40004          A          0         0 |
  8. | 40004          A          0         0 |
  9. | 40004          A          0     12000 |
 10. | 40004          A        141         0 |
     |---------------------------------------|
 11. | 40004          A         80         0 |
 12. | 40004          A        159         0 |
 13. | 40004          A          0         0 |
 14. | 40005          A       2919     39945 |
 15. | 40009          A         52     34031 |
     |---------------------------------------|
 16. | 40010          A        614     84000 |
 17. | 40010          A         40     56000 |
 18. | 40010          A         56         0 |
 19. | 40010          A        210         0 |
 20. | 40011          A          0     21000 |
     +---------------------------------------+

. 
. by duid cpsfamid: egen famoop=sum(totslf14)

. by duid cpsfamid: egen faminc=sum(ttlp14x)

. by duid cpsfamid: gen  famsize=_N

. 
. list duid cpsfamid famwt14c famsize famoop faminc totslf14 ttlp14x in 1/20

     +---------------------------------------------------------------------------------+
     |  duid   cpsfamid      famwt14c   famsize   famoop   faminc   totslf14   ttlp14x |
     |---------------------------------------------------------------------------------|
  1. | 40001          A   6540.855033         4      541    68000        152     56000 |
  2. | 40001          A   6540.855033         4      541    68000         89         0 |
  3. | 40001          A   6540.855033         4      541    68000        135         0 |
  4. | 40001          A   6540.855033         4      541    68000        165     12000 |
  5. | 40002          A   8827.999691         1        2    27030          2     27030 |
     |---------------------------------------------------------------------------------|
  6. | 40004          A   3883.956829         8      392    12000         12         0 |
  7. | 40004          A   3883.956829         8      392    12000          0         0 |
  8. | 40004          A   3883.956829         8      392    12000          0         0 |
  9. | 40004          A   3883.956829         8      392    12000          0     12000 |
 10. | 40004          A   3883.956829         8      392    12000        141         0 |
     |---------------------------------------------------------------------------------|
 11. | 40004          A   3883.956829         8      392    12000         80         0 |
 12. | 40004          A   3883.956829         8      392    12000        159         0 |
 13. | 40004          A             0         8      392    12000          0         0 |
 14. | 40005          A   4676.866677         1     2919    39945       2919     39945 |
 15. | 40009          A   5826.471609         1       52    34031         52     34031 |
     |---------------------------------------------------------------------------------|
 16. | 40010          A   7601.435978         4      920   140000        614     84000 |
 17. | 40010          A   7601.435978         4      920   140000         40     56000 |
 18. | 40010          A   7601.435978         4      920   140000         56         0 |
 19. | 40010          A   7601.435978         4      920   140000        210         0 |
 20. | 40011          A   4747.996871         4        0    22500          0     21000 |
     +---------------------------------------------------------------------------------+

. 
. sort duid cpsfamid famwt14c

. by duid cpsfamid: keep if _n==_N
(19,875 observations deleted)

. 
. list duid cpsfamid famwt14c famsize famoop faminc in 1/20

     +------------------------------------------------------------+
     |  duid   cpsfamid      famwt14c   famsize   famoop   faminc |
     |------------------------------------------------------------|
  1. | 40001          A   6540.855033         4      541    68000 |
  2. | 40002          A   8827.999691         1        2    27030 |
  3. | 40004          A   3883.956829         8      392    12000 |
  4. | 40005          A   4676.866677         1     2919    39945 |
  5. | 40009          A   5826.471609         1       52    34031 |
     |------------------------------------------------------------|
  6. | 40010          A   7601.435978         4      920   140000 |
  7. | 40011          A   4747.996871         4        0    22500 |
  8. | 40012          A   13579.43163         4      177   193561 |
  9. | 40014          A   5232.952108         1      954        0 |
 10. | 40014          B   6675.632912         1        5    14720 |
     |------------------------------------------------------------|
 11. | 40014          C   5180.243832         1        2        0 |
 12. | 40015          A   19589.16423         3     2275    99945 |
 13. | 40016          A   4050.439479         3       21    13200 |
 14. | 40017          A   22006.18378         3      648   200000 |
 15. | 40019          A    3638.43409         5      833    85536 |
     |------------------------------------------------------------|
 16. | 40020          A   12530.81738         5     1941    47881 |
 17. | 40021          A   4682.935416         4      782    20800 |
 18. | 40022          A   1887.677514         1        0    17000 |
 19. | 40022          B   5843.593601         4       37    50000 |
 20. | 40023          A   6209.294748         4     3417    82800 |
     +------------------------------------------------------------+

. 
. tabmiss famsize famoop faminc
    Variable |     Obs       Missings   Feq.Missings    NonMiss   Feq.NonMiss
-------------+---------------------------------------------------------------
     famsize |   15000           0            0          15000          100
      famoop |   15000           0            0          15000          100
      faminc |   15000           0            0          15000          100

. 
. keep if famwt14c>0
(867 observations deleted)

. svyset [pweight= famwt14c], strata( varstr) psu(varpsu) vce(linearized) singleunit(missing)

      pweight: famwt14c
          VCE: linearized
  Single unit: missing
     Strata 1: varstr
         SU 1: varpsu
        FPC 1: <zero>

. svy: mean famsize famoop faminc
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     165      Number of obs   =       14,133
Number of PSUs   =     365      Population size =  140,282,371
                                Design df       =          200

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
     famsize |   2.221791   .0205013      2.181364    2.262217
      famoop |   1279.595   28.96032      1222.488    1336.702
      faminc |   63373.64   1015.978      61370.24    65377.05
--------------------------------------------------------------

. 
. log close  
      name:  <unnamed>
       log:  \\files.s-3.com\HPDA\AHRQ\Fang\bj001\exercise3.log
  log type:  text
 closed on:  22 Feb 2017, 14:30:33
-----------------------------------------------------------------------------------------------------
