-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\files.s-3.com\HPDA\AHRQ\Fang\bj001\exercise2.log
  log type:  text
 opened on:  22 Feb 2017, 14:25:24

. cd \\files.s-3.com\HPDA\AHRQ\Fang\bj001
\\files.s-3.com\HPDA\AHRQ\Fang\bj001

. 
. // 1) identify antipsychotic drugs using therapeutic classification (tc) codes
. use dupersid rxrecidx linkidx tc1 tc1s1 rxxp14x rxsf14x if tc1==242 & tc1s1==251 using h168a

. list dupersid rxrecidx linkidx rxxp14x rxsf14x in 1/30, table

     +---------------------------------------------------------------+
     | dupersid          rxrecidx        linkidx   rxxp14x   rxsf14x |
     |---------------------------------------------------------------|
  1. | 40097101   400971010931001   400971010931    116.84        12 |
  2. | 40097101   400971010931002   400971010931    149.11        12 |
  3. | 40097101   400971010951001   400971010951     25.21        12 |
  4. | 40097101   400971010951002   400971010951     25.71        12 |
  5. | 40097101   400971010961001   400971010961      4.27      4.27 |
     |---------------------------------------------------------------|
  6. | 40097101   400971010961002   400971010961         3         3 |
  7. | 40097101   400971011101001   400971011101    149.11        12 |
  8. | 40097101   400971011101002   400971011101    166.58        12 |
  9. | 40097101   400971011101003   400971011101     141.4        12 |
 10. | 40097101   400971011101004   400971011101    139.76        12 |
     |---------------------------------------------------------------|
 11. | 40097101   400971011121001   400971011121     25.21        12 |
 12. | 40097101   400971011121002   400971011121     25.21        12 |
 13. | 40097101   400971011121003   400971011121     25.71        12 |
 14. | 40097101   400971011121004   400971011121     25.71        12 |
 15. | 40097101   400971011131001   400971011131      2.84      2.84 |
     |---------------------------------------------------------------|
 16. | 40097101   400971011131002   400971011131      3.76      3.76 |
 17. | 40097101   400971011131003   400971011131      3.76      3.76 |
 18. | 40097101   400971011131004   400971011131      3.76      3.76 |
 19. | 40097101   400971011181001   400971011181    129.09        12 |
 20. | 40097101   400971011181002   400971011181    127.34        12 |
     |---------------------------------------------------------------|
 21. | 40097101   400971011181003   400971011181     127.5        12 |
 22. | 40097101   400971011201001   400971011201     25.21        12 |
 23. | 40097101   400971011201002   400971011201     25.21        12 |
 24. | 40097101   400971011201003   400971011201     25.71        12 |
 25. | 40097101   400971011211001   400971011211      3.75      3.75 |
     |---------------------------------------------------------------|
 26. | 40097101   400971011211002   400971011211      3.75      3.75 |
 27. | 40097101   400971011211003   400971011211      3.75      3.75 |
 28. | 40209101   402091010121001   402091010121    998.99         0 |
 29. | 40224103   402241030181001   402241030181        10        10 |
 30. | 40224103   402241030181002   402241030181        10        10 |
     +---------------------------------------------------------------+

. tab1 tc1 tc1s1

-> tabulation of tc1  

     MULTUM |
THERAPEUTIC |
   CLASS #1 |      Freq.     Percent        Cum.
------------+-----------------------------------
        242 |      3,547      100.00      100.00
------------+-----------------------------------
      Total |      3,547      100.00

-> tabulation of tc1s1  

     MULTUM |
THERAPEUTIC |
  SUB-CLASS |
 #1 FOR TC1 |      Freq.     Percent        Cum.
------------+-----------------------------------
        251 |      3,547      100.00      100.00
------------+-----------------------------------
      Total |      3,547      100.00

. 
. // 2) sum data to person-level
. sort dupersid

. by dupersid: egen tot=sum(rxxp14x)

. by dupersid: egen oop=sum(rxsf14x)

. by dupersid: gen n_purchase=_n

. 
. list dupersid n_purchase tot oop rxxp14x rxsf14x in 1/20

     +------------------------------------------------------------+
     | dupersid   n_purc~e       tot      oop   rxxp14x   rxsf14x |
     |------------------------------------------------------------|
  1. | 40097101          1   1508.26   248.64    116.84        12 |
  2. | 40097101          2   1508.26   248.64    149.11        12 |
  3. | 40097101          3   1508.26   248.64     25.21        12 |
  4. | 40097101          4   1508.26   248.64     25.71        12 |
  5. | 40097101          5   1508.26   248.64      4.27      4.27 |
     |------------------------------------------------------------|
  6. | 40097101          6   1508.26   248.64         3         3 |
  7. | 40097101          7   1508.26   248.64    149.11        12 |
  8. | 40097101          8   1508.26   248.64    166.58        12 |
  9. | 40097101          9   1508.26   248.64     141.4        12 |
 10. | 40097101         10   1508.26   248.64    139.76        12 |
     |------------------------------------------------------------|
 11. | 40097101         11   1508.26   248.64     25.21        12 |
 12. | 40097101         12   1508.26   248.64     25.21        12 |
 13. | 40097101         13   1508.26   248.64     25.71        12 |
 14. | 40097101         14   1508.26   248.64     25.71        12 |
 15. | 40097101         15   1508.26   248.64      2.84      2.84 |
     |------------------------------------------------------------|
 16. | 40097101         16   1508.26   248.64      3.76      3.76 |
 17. | 40097101         17   1508.26   248.64      3.76      3.76 |
 18. | 40097101         18   1508.26   248.64      3.76      3.76 |
 19. | 40097101         19   1508.26   248.64    129.09        12 |
 20. | 40097101         20   1508.26   248.64    127.34        12 |
     +------------------------------------------------------------+

. 
. by dupersid: keep if _n==_N
(3,093 observations deleted)

. gen third_payer   = tot - oop

. 
. // 3) merge the person-level expenditures to the fy puf 
. tempfile perdrug

. save "`perdrug'"
file C:\Users\ggrodsky\AppData\Local\Temp\ST_04000001.tmp saved

. 
. use dupersid varstr varpsu perwt14f using h171

. sort dupersid

. 
. merge 1:m dupersid using "`perdrug'", keep(master matches)

    Result                           # of obs.
    -----------------------------------------
    not matched                        34,421
        from master                    34,421  (_merge==1)
        from using                          0  (_merge==2)

    matched                               454  (_merge==3)
    -----------------------------------------

. tabmiss  n_purchase tot oop third_payer
    Variable |     Obs       Missings   Feq.Missings    NonMiss   Feq.NonMiss
-------------+---------------------------------------------------------------
  n_purchase |   34875       34421         98.7            454        1.302
         tot |   34875       34421         98.7            454        1.302
         oop |   34875       34421         98.7            454        1.302
 third_payer |   34875       34421         98.7            454        1.302

. 
. gen sub=(_merge==3)

. tab sub

        sub |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     34,421       98.70       98.70
          1 |        454        1.30      100.00
------------+-----------------------------------
      Total |     34,875      100.00

. 
. recode n_purchase tot oop third_payer (missing=0)
(n_purchase: 34421 changes made)
(tot: 34421 changes made)
(oop: 34421 changes made)
(third_payer: 34421 changes made)

. sum n_purchase tot oop third_payer if sub==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  n_purchase |     34,421           0           0          0          0
         tot |     34,421           0           0          0          0
         oop |     34,421           0           0          0          0
 third_payer |     34,421           0           0          0          0

. 
.  keep if perwt14f>0
(1,713 observations deleted)

. // 4) calculate estimates on expenditures and use
. svyset [pweight= perwt14f], strata( varstr) psu(varpsu) vce(linearized) singleunit(missing)

      pweight: perwt14f
          VCE: linearized
  Single unit: missing
     Strata 1: varstr
         SU 1: varpsu
        FPC 1: <zero>

. 
. svy, subpop(sub): mean n_purchase tot oop third_payer, cformat(%8.3g)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     140      Number of obs   =       29,027
Number of PSUs   =     310      Population size =  281,209,796
                                Subpop. no. obs =          445
                                Subpop. size    = 4,478,819.78
                                Design df       =          170

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
  n_purchase |       7.75       .366          7.02        8.47
         tot |       2656        203          2256        3056
         oop |        203       70.9            63         343
 third_payer |       2453        207          2044        2862
--------------------------------------------------------------
Note: 25 strata omitted because they contain no subpopulation
      members.

. svy, subpop(sub): total n_purchase tot oop third_payer
(running total on estimation sample)

Survey: Total estimation

Number of strata =     140      Number of obs   =       29,027
Number of PSUs   =     310      Population size =  281,209,796
                                Subpop. no. obs =          445
                                Subpop. size    = 4,478,819.78
                                Design df       =          170

--------------------------------------------------------------
             |             Linearized
             |      Total   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
  n_purchase |   3.47e+07    2737619      2.93e+07    4.01e+07
         tot |   1.19e+10   1.16e+09      9.61e+09    1.42e+10
         oop |   9.09e+08   3.10e+08      2.97e+08    1.52e+09
 third_payer |   1.10e+10   1.18e+09      8.66e+09    1.33e+10
--------------------------------------------------------------
Note: 25 strata omitted because they contain no subpopulation
      members.

. estimates table, b(%13.0f) se(%11.0f)

------------------------------
    Variable |    active      
-------------+----------------
  n_purchase |      34695151  
             |       2737619  
         tot |   11895377973  
             |    1156964816  
         oop |     909418090  
             |     310456103  
 third_payer |   10985959902  
             |    1180157604  
------------------------------
                  legend: b/se

. 
. log close  
      name:  <unnamed>
       log:  \\files.s-3.com\HPDA\AHRQ\Fang\bj001\exercise2.log
  log type:  text
 closed on:  22 Feb 2017, 14:27:46
-----------------------------------------------------------------------------------------------------
