-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\files.s-3.com\HPDA\AHRQ\Fang\bj001\exercise4.log
  log type:  text
 opened on:  22 Feb 2017, 14:33:00

. cd \\files.s-3.com\HPDA\AHRQ\Fang\bj001
\\files.s-3.com\HPDA\AHRQ\Fang\bj001

. 
. // 1) pull out conditions with diabetes (ccs code='049', '050') from 2014 condition puf - hc170
. use dupersid cccodex using h170

. 
. keep if cccodex=="049" | cccodex=="050"
(113,588 observations deleted)

. // check ccs codes for diabetic conditions
. tab cccodex

   CLINICAL |
CLASSIFICAT |
 ION CODE - |
     EDITED |      Freq.     Percent        Cum.
------------+-----------------------------------
        049 |      3,009       97.35       97.35
        050 |         82        2.65      100.00
------------+-----------------------------------
      Total |      3,091      100.00

. 
. // 2) identify persons who reported diabetes
. keep dupersid

. sort dupersid

. by dupersid: keep if _n==1
(209 observations deleted)

. 
. tempfile diab

. save "`diab'"
file C:\Users\ggrodsky\AppData\Local\Temp\ST_04000001.tmp saved

. 
. use dupersid varstr varpsu perwt14f sex totexp14 totslf14 obtotv14 using h171

. 
. sort dupersid

. merge 1:1 dupersid using "`diab'"

    Result                           # of obs.
    -----------------------------------------
    not matched                        31,993
        from master                    31,993  (_merge==1)
        from using                          0  (_merge==2)

    matched                             2,882  (_merge==3)
    -----------------------------------------

. 
. // 3) create a flag for persons with diabetes in the 2014 fy data
. gen diabper=(_merge==3)

. tab diabper _merge

           |        _merge
   diabper | master on  matched ( |     Total
-----------+----------------------+----------
         0 |    31,993          0 |    31,993 
         1 |         0      2,882 |     2,882 
-----------+----------------------+----------
     Total |    31,993      2,882 |    34,875 


. 
. // unweighted # of persons who reported diabetes, 2014
. tab diabper sex

           |          SEX
   diabper |         1          2 |     Total
-----------+----------------------+----------
         0 |    15,387     16,606 |    31,993 
         1 |     1,281      1,601 |     2,882 
-----------+----------------------+----------
     Total |    16,668     18,207 |    34,875 


. // weighted # of persons who reported diabetes, 2014
. tab diabper sex [iweight=perwt14f]

           |          SEX
   diabper |         1          2 |     Total
-----------+----------------------+----------
         0 | 1.429e+08  1.487e+08 | 2.916e+08 
         1 |12945516.8   13875223 |  26820740 
-----------+----------------------+----------
     Total | 1.559e+08  1.626e+08 | 3.184e+08 


. 
. tabmiss  totexp14 totslf14 obtotv14
    Variable |     Obs       Missings   Feq.Missings    NonMiss   Feq.NonMiss
-------------+---------------------------------------------------------------
    totexp14 |   34875           0            0          34875          100
    totslf14 |   34875           0            0          34875          100
    obtotv14 |   34875           0            0          34875          100

. 
. // 4) calculate estimates on use and expenditures for persons who reported diabetes
. svyset [pweight= perwt14f], strata( varstr) psu(varpsu) vce(linearized) singleunit(missing)

      pweight: perwt14f
          VCE: linearized
  Single unit: missing
     Strata 1: varstr
         SU 1: varpsu
        FPC 1: <zero>

. 
. svy, subpop(diabper): mean totexp14 totslf14 obtotv14
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     165      Number of obs   =       34,875
Number of PSUs   =     366      Population size =  318,440,423
                                Subpop. no. obs =        2,801
                                Subpop. size    = 26,820,740.3
                                Design df       =          201

--------------------------------------------------------------
             |             Linearized
             |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
    totexp14 |   13724.59    686.396      12371.13    15078.05
    totslf14 |   1181.273   50.75443      1081.193    1281.352
    obtotv14 |   12.26874   .4088276       11.4626    13.07488
--------------------------------------------------------------

. svy, subpop(diabper): mean totexp14 totslf14 obtotv14, over(sex)
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     165      Number of obs   =       34,875
Number of PSUs   =     366      Population size =  318,440,423
                                Subpop. no. obs =        2,801
                                Subpop. size    = 26,820,740.3
                                Design df       =          201

            1: sex = 1
            2: sex = 2

--------------------------------------------------------------
             |             Linearized
        Over |       Mean   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
totexp14     |
           1 |   13862.79   1179.963       11536.1    16189.49
           2 |   13595.64   851.8101      11916.01    15275.27
-------------+------------------------------------------------
totslf14     |
           1 |   1200.001   75.63031      1050.871    1349.132
           2 |   1163.799   70.90124      1023.994    1303.605
-------------+------------------------------------------------
obtotv14     |
           1 |   11.44083   .6554568      10.14837    12.73328
           2 |   13.04119   .5360566      11.98417     14.0982
--------------------------------------------------------------

. 
. svy, subpop(diabper): tabulate sex, obs count percent format(%14.3gc)
(running tabulate on estimation sample)

Number of strata   =       165                Number of obs     =       34,875
Number of PSUs     =       366                Population size   =  318,440,423
                                              Subpop. no. obs   =        2,801
                                              Subpop. size      = 26,820,740.3
                                              Design df         =          201

----------------------------------
      SEX |      count         obs
----------+-----------------------
        1 | 12,945,517       1,281
        2 | 13,875,223       1,601
          | 
    Total | 26,820,740       2,882
----------------------------------
  Key:  count     =  weighted count
        obs       =  number of observations

. 
. log close  
      name:  <unnamed>
       log:  \\files.s-3.com\HPDA\AHRQ\Fang\bj001\exercise4.log
  log type:  text
 closed on:  22 Feb 2017, 14:34:51
-----------------------------------------------------------------------------------------------------
